In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [3]:
s. index

NameError: name 's' is not defined

In [4]:
nums = pd.Series(range(500))

In [5]:
# 500개의 값을 갖는 시리즈 생성
nums = pd.Series(range(500))
print(nums)

0        0
1        1
2        2
3        3
4        4
      ...
495    495
496    496
497    497
498    498
499    499
Length: 500, dtype: int64

In [6]:
nums.head(10)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [7]:
nums.tail(10)

490    490
491    491
492    492
493    493
494    494
495    495
496    496
497    497
498    498
499    499
dtype: int64

In [8]:
nums = pd.Series([1, 2, np.nan, 4, 5])
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [9]:
hello = pd.Series(list("hello"))
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [10]:
nums.count()

4

In [11]:
len(nums)

5

In [12]:
nums.sum()

12.0

In [13]:
nums.mean()

3.0

In [14]:
nums.median()

3.0

In [15]:
nums.std()

1.8257418583505538

In [16]:
nums.max()

5.0

In [17]:
nums.min()

1.0

In [18]:
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [20]:
superheros = [
    "Batman",
    "Superman",
    "Spider-Man",
    "Iron Man",
    "Captain America",
    "Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)

In [21]:
heros = pd.Series(data=strength_levels, index=superheros)

In [22]:
heros

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [36]:
heros.tail(4)

Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [38]:
heros.nunique()

5

In [28]:
heros.mean()
#평균 구하기

105.83333333333333

In [29]:
heros.median()
# 중간값 구하기

105.0

In [30]:
heros.max()
# 최대값 구하기

120

In [31]:
heros.min()
# 최소값 구하기

90

In [32]:
heros

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [33]:
list(heros)

[100, 120, 90, 95, 110, 120]

In [35]:
dict(heros)

{'Batman': 100,
 'Superman': 120,
 'Spider-Man': 90,
 'Iron Man': 95,
 'Captain America': 110,
 'Wonder Woman': 120}

In [42]:
pd.read_csv("datas/pokemon.csv", index_col="Pokemon", squeeze=True)

C:\Users\Playdata\AppData\Local\Temp\ipykernel_9740\644558881.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  pd.read_csv("datas/pokemon.csv", index_col="Pokemon", squeeze=True)

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [43]:
pd.read_csv("datas/pokemon.csv", index_col="Pokemon"). squeeze

<bound method NDFrame.squeeze of                        Type
Pokemon
Bulbasaur    Grass / Poison
Ivysaur      Grass / Poison
Venusaur     Grass / Poison
Charmander             Fire
Charmeleon             Fire
...                     ...
Stakataka      Rock / Steel
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel

[809 rows x 1 columns]>

In [46]:
pokemons = pd.read_csv("datas/pokemon.csv", index_col="Pokemon", squeeze=True)
pokemons

C:\Users\Playdata\AppData\Local\Temp\ipykernel_9740\2752634572.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  pokemons = pd.read_csv("datas/pokemon.csv", index_col="Pokemon", squeeze=True)

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [50]:
pokemons.count()
# 데이터의 총 개수

809

In [54]:
pokemons.nunique()
# 데이터의 고유한 값의 종류

159

In [56]:
pokemons.max()
# 데이터의 최대값

'Water / Steel'

In [59]:
pokemons.min()
# 데이터의 최소값

'Bug'

In [58]:
pokemons.describe()
#데이터의 특징을 파악하는 방법(데이터의 형태를 설명하는 방법)
 # 데이터의 총 개수 
 # 데이터의 고유한 값의 종류
 # 제일 많이 가지고 있는 값
 # 제일 많이 갖는 값의 개수

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [62]:
pokemons.tail(4)
# 데이터의 끝에서 4개를 추출 하는 방법

Pokemon
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel
Name: Type, dtype: object

In [63]:
pokemons.sort_values()
#series의 값을 정렬하는 방법
# 오름차순으로 값이 정렬되어 있는 것을 볼 수 있다.
#

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [64]:
pokemons.sort_values(ascending = False)
#accending 의 값이 True인 경우 오름차순/ False인 경우 내림차순으로 정리 한다.

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [69]:
pd.read_csv("datas/google_stocks.csv",
             parse_dates=["Date"],
             index_col="Date").squeeze()

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [ ]:
war= pd.read_csv("datas/revolutionary_war.csv",
             parse_dates=["Start Date"],
             index_col="Start Date",
             usecols=["Start Date", "State"],
             squeeze = True)

In [78]:
war

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [76]:
war.describe()

count                162
unique                17
top       South Carolina
freq                  31
Name: State, dtype: object

In [79]:
war.sort_values()

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [103]:
war.isnull().sum()
len(war) - war.count()
#nan값을 갖는 데이터는 몇개 인가요?

70

In [105]:
war.count()
# 결측치(비어있는 값)를 제외한 개수를 구하는 방법은?
# count는 기본적으로 nan(비어있는 값)을 계산하지 않는다.

162

In [84]:
war.nunique("nan")
# 유일한 값의 개수는 몇개인가?
# 유일한 state의 개수는 17개 이다.

17

In [106]:
war.sort_values(na_position="first")
#nan 값을 정렬하는 방법은 인수에 first와 lsat값을 사용하면 된다.

Start Date
1775-09-17         NaN
1775-12-31         NaN
1776-03-03         NaN
1776-03-25         NaN
1776-05-18         NaN
                ...
1781-07-06    Virginia
1781-07-01    Virginia
1781-06-26    Virginia
1781-04-25    Virginia
1783-01-22    Virginia
Name: State, Length: 232, dtype: object

In [107]:
war.sort_values(na_position="last")
#nan 값을 정렬하는 방법은 인수에 first와 lsat값을 사용하면 된다.

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [109]:
war.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [111]:
pokemons.sort_index(ascending=True)

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [112]:
war.sort_index()
#data를 inplace 시키는 방법이다.

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [113]:
war.sort_index(na_position="first")
#na의 위치를 앞쪽에 설정 하는 경우

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [115]:
war.sort_index(na_position="last")
#na의 위치를 뒤쪽에 설정 하는 경우

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [121]:
war.index.dropna()

DatetimeIndex(['1774-09-01', '1774-12-14', '1775-04-19', '1775-04-19',
               '1775-04-20', '1775-05-10', '1775-05-27', '1775-06-11',
               '1775-06-17', '1775-08-08',
               ...
               '1782-08-08', '1782-08-15', '1782-08-19', '1782-08-26',
               '1782-08-25', '1782-09-11', '1782-09-13', '1782-10-18',
               '1782-12-06', '1783-01-22'],
              dtype='datetime64[ns]', name='Start Date', length=228, freq=None)

In [122]:
war.index.dropna().nunique()

217

In [119]:
war.index.notnull()

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True, False,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True, False,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True, False,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True, False,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True])

In [117]:
#series의 index안에 포함되어 있는 Nat 값을 배제하는 두가지 방법입니다.
war.loc[war.index.dropna()] 
war.loc[war.index.notnull()] 
# 두개의 코딩의 차이가 무엇인지 체크하기

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [132]:
war.sort_values(ascending = True). head(10)
#앞에서 데이터를 추출하는 경우 사용하는 메서드가 바로 head이다.
#반대로 데이터를 뒤에서 추출하는 경우 사용하는 메서드는 바로 Tail이다.
#ascending은 오름차순(큰 값)으로 값을 정렬하는 함수이다.
#head()는 뽑아내고자 하는 index의 개수를 설정하는 방법이다.

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
1779-09-10        Florida
1779-09-07        Florida
1780-03-02        Florida
1778-06-30        Florida
1781-01-07        Florida
Name: State, dtype: object

In [133]:
war.sort_values(ascending = False). head(10)

Start Date
1783-01-22    Virginia
1781-09-28    Virginia
1779-05-10    Virginia
1781-09-05    Virginia
1781-07-06    Virginia
1781-07-01    Virginia
1780-05-25    Virginia
1776-01-01    Virginia
1778-09-07    Virginia
1775-12-09    Virginia
Name: State, dtype: object

In [141]:
war.loc[war.index.dropna()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-19    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 250, dtype: object

In [147]:
pd.read_csv("datas/google_stocks.csv",
             parse_dates=["Date"],
             index_col="Date").squeeze()

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [159]:
pd.read_csv("datas/google_stocks.csv")

            Date    Close
0     2004-08-19    49.98
1     2004-08-20    53.95
2     2004-08-23    54.50
3     2004-08-24    52.24
4     2004-08-25    52.80
...          ...      ...
3819  2019-10-21  1246.15
3820  2019-10-22  1242.80
3821  2019-10-23  1259.13
3822  2019-10-24  1260.99
3823  2019-10-25  1265.13

[3824 rows x 2 columns]

In [13]:
google= pd.read_csv("datas/google_stocks.csv",
                    parse_dates=["Date"],
                    index_col="Date",
                    usecols=["Date", "Close"],
                    squeeze = True)

C:\Users\Playdata\AppData\Local\Temp\ipykernel_7428\3630592457.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  google= pd.read_csv("datas/google_stocks.csv",

In [14]:
google.sort_values(ascending=False).head(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [12]:
google.sort_values(ascending=True).head(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [15]:
google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [16]:
google.nsmallest(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [3]:
bins = np.linspace(0, 1400, 8)
bins

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [18]:
google.value_counts(bins=bins)

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [20]:
google.value_counts(bins = [0, 200, 400, 600, 800, 1000, 1200, 1400]).sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [21]:
google.value_counts(bins=8, sort=False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [27]:
nan_dic =[
    {"c1" : 1, "c2" : 1.11, "c3" : 'one'},
    {"c1" : 2, "c2" : " " , "c3" : 'two'},
    {"c1" : "누락", "c2" : 3.33, "c3" : 'three'}]

df_csv = pd.DataFrame(nan_dic)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [28]:
# 강사님 방식의 코딩

data = {
    "c1" : [1, 2, "누락"],
    "c2" : [1.11, "", 3.33],
    "c3" : ["one", "two", "three"]}
df_csv = pd.DataFrame(data)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [37]:
df_csv.to_csv("datas/sample1.csv", index=False)

In [ ]:
csv01.to_csv("datas/sample1.csv", index=False)

In [44]:
df_csv.to_csv("sample.csv", index=False)
# csv로부터 파일을 불러와서 데이터를 읽어내는 방식이다.
# 위의 과정을 위해서 데이터를 입력하는 과정이다.
# 이파일의 폴더의 절대경로 이름은 sample.csv

In [45]:
df_read = pd.read_csv("sample.csv")
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [57]:
df_csv.to_csv("datas/sample2.csv", index=False, header=False)
# csv로부터 파일을 불러와서 데이터를 읽어내는 방식이다.
# 위의 과정을 위해서 데이터를 입력하는 과정이다.
# 이파일의 폴더의 절대경로 이름은 sample2.csv
# header=False 키워드를 추가해서 파일명을 sample2.csv로 지정하고 실행하는 방식이다.
# 구체적인 폴더의 이름을 설정을 해주어야만 해당 폴더에 sample2가 생성이 되게 된다.

In [58]:
pd.read_csv('datas/sample2.csv', names=['c1', 'c2', 'c3'])
# names라는 키워드를 통하여 column인덱스 정보를 직접 추가 해보기
#

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [70]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [73]:
%pwd

'C:\\python'

In [74]:
pd.read_table('datas/sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [76]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [77]:
pd.read_table('datas/sample4.txt', skiprows=[0, 1])

       c1, c2, c3
0    1, 1.11, one
1    2, 2.22, two
2  3, 3.33, three

In [79]:
df_na_val = pd.read_csv('datas/sample1.csv', na_values=['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [80]:
df_na_val.to_csv('datas/sample5.txt', sep='|')

#sep 인수로 구분자를 변경 할 수 있다.

In [81]:
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [83]:
df_na_val.to_csv('sample6.csv', na_rep="누락")
#na_rep 키워드 인수를 통해서 NaN 표시 값을 바꿀 수 있다.

In [84]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [88]:
titanic
#타이타닉이라는 데이터 프레임 파일은 웹사이트에서 데이터를 불러오는 경우 많이 사용한다.
# 627개의 데이터를 가지고 있다.

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [91]:
# 만약 앞이나 뒤의 특정 개수를 보고 싶은 경우에는 head, tail을 통해서 개수를 조회가능하다.
titanic.head(10)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y

In [92]:
titanic.tail(10)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
617,1,female,15.0,0,0,7.2250,Third,unknown,Cherbourg,y
618,0,male,20.0,0,0,9.8458,Third,unknown,Southampton,y
619,0,male,19.0,0,0,7.8958,Third,unknown,Southampton,y
620,0,male,28.0,0,0,7.8958,Third,unknown,Southampton,y
621,0,female,22.0,0,0,10.5167,Third,unknown,Southampton,y
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [127]:
import pandas as pd

In [132]:
file_path="datas/traffic_accident_2016.csv"

In [133]:
df = pd.read_csv(file_path)

In [134]:
df.head(5)

,발생년,발생년월일시,발생분,주야,요일,사망자수,사상자수,중상자수,경상자수,부상신고자수,...,도로형태_대분류,도로형태,당사자종별_1당_대분류,당사자종별_1당,당사자종별_2당_대분류,당사자종별_2당,발생위치X_UTMK,발생위치Y_UTMK,경도,위도
0,2016,2016122320,35,야간,금,1,1,0,0,0,...,교차로,교차로내,승용차,중형,보행자,보행자,981731,1932086,127.293623,37.387686
1,2016,2016122517,48,주간,일,1,1,0,0,0,...,단일로,기타단일로,승용차,중형,보행자,보행자,945989,1942347,126.889123,37.478777
2,2016,2016122519,5,야간,일,1,1,0,0,0,...,단일로,기타단일로,화물차,소형,보행자,보행자,993981,1879534,127.431592,36.915926
3,2016,2016122610,40,주간,월,1,1,0,0,0,...,단일로,기타단일로,승합차,경형,보행자,보행자,1161153,1751026,129.282183,35.742393
4,2016,2016122819,40,야간,수,1,1,0,0,0,...,단일로,기타단일로,승용차,소형,보행자,보행자,1056276,1686645,128.118016,35.173512

In [135]:
import pandas as pd

In [138]:
file_path="datas/foreign exchange reserves.csv"

In [139]:
df = pd.read_csv(file_path)

In [140]:
df.head(5)

,통계표,계정항목,단위,변환,2021/02,2021/03,2021/04,2021/05,2021/06,2021/07,...,2022/05,2022/06,2022/07,2022/08,2022/09,2022/10,2022/11,2022/12,2023/01,2023/02
0,3.5. 외환보유액,외환,천달러,원자료,"434,365,551","433,222,626","439,294,230","443,481,045","441,229,418","445,714,839",...,"423,355,152","414,491,928","415,046,922","412,848,791","393,596,481","390,643,871","392,302,775","399,043,064","405,587,805","401,243,805"

In [141]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 29 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   통계표      1 non-null      object
 1   계정항목     1 non-null      object
 2   단위       1 non-null      object
 3   변환       1 non-null      object
 4   2021/02  1 non-null      object
 5   2021/03  1 non-null      object
 6   2021/04  1 non-null      object
 7   2021/05  1 non-null      object
 8   2021/06  1 non-null      object
 9   2021/07  1 non-null      object
 10  2021/08  1 non-null      object
 11  2021/09  1 non-null      object
 12  2021/10  1 non-null      object
 13  2021/11  1 non-null      object
 14  2021/12  1 non-null      object
 15  2022/01  1 non-null      object
 16  2022/02  1 non-null      object
 17  2022/03  1 non-null      object
 18  2022/04  1 non-null      object
 19  2022/05  1 non-null      object
 20  2022/06  1 non-null      object
 21  2022/07  1 non-null      object
 22  2022/08  1 non-null      object
 23  2022/09  1 non-null      object
 24  2022/10  1 non-null      object
 25  2022/11  1 non-null      object
 26  2022/12  1 non-null      object
 27  2023/01  1 non-null      object
 28  2023/02  1 non-null      object
dtypes: object(29)
memory usage: 360.0+ bytes

In [142]:
df.describe()

,통계표,계정항목,단위,변환,2021/02,2021/03,2021/04,2021/05,2021/06,2021/07,...,2022/05,2022/06,2022/07,2022/08,2022/09,2022/10,2022/11,2022/12,2023/01,2023/02
count,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
unique,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
top,3.5. 외환보유액,외환,천달러,원자료,"434,365,551","433,222,626","439,294,230","443,481,045","441,229,418","445,714,839",...,"423,355,152","414,491,928","415,046,922","412,848,791","393,596,481","390,643,871","392,302,775","399,043,064","405,587,805","401,243,805"
freq,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1

In [143]:
df.head(5)

,통계표,계정항목,단위,변환,2021/02,2021/03,2021/04,2021/05,2021/06,2021/07,...,2022/05,2022/06,2022/07,2022/08,2022/09,2022/10,2022/11,2022/12,2023/01,2023/02
0,3.5. 외환보유액,외환,천달러,원자료,"434,365,551","433,222,626","439,294,230","443,481,045","441,229,418","445,714,839",...,"423,355,152","414,491,928","415,046,922","412,848,791","393,596,481","390,643,871","392,302,775","399,043,064","405,587,805","401,243,805"